# clean

Data cleaning example: annual NYC electrical generation sources.

In [1]:
from pandas import read_csv
from tools import DATADIR, afew

In [2]:
CLEAN = DATADIR / 'clean/energy.csv'
DIRTY = DATADIR / 'dirty/energy.csv'

## read dirty data from CSV

In [3]:
print("Read", DIRTY)
data = read_csv(DIRTY)
data.info()

Read /home/kos/data/dirty/energy.csv
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 57 entries, 0 to 56
Data columns (total 15 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Year           57 non-null     int64
 1   Coal           37 non-null     float64
 2   Natural Gas    37 non-null     float64
 3   Petroleum      37 non-null     float64
 4   Conv. Hydro    57 non-null     int64
 5   PS Hydro       24 non-null     float64
 6   Nuclear        57 non-null     int64
 7   Net Imports    37 non-null     float64
 8   Other          27 non-null     float64
 9   Waste          16 non-null     float64
 10  LFG            16 non-null     float64
 11  Wood           16 non-null     float64
 12  Wind           37 non-null     float64
 13  Solar          57 non-null     int64
 14  Total          37 non-null     float64
dtypes: float64(11), int64(4)
memory usage: 6.8 KB

## inspect some rows

In [4]:
data.head()

,Year,Coal,Natural Gas,Petroleum,Conv. Hydro,PS Hydro,Nuclear,Net Imports,Other,Waste,LFG,Wood,Wind,Solar,Total
0,2016,1493.0,56793.0,643.0,26314,836.0,41638,26117.0,2881.0,1841.0,748.0,293.0,3943.0,140,160798.0
1,2015,2046.0,56923.0,1892.0,25879,825.0,44620,22273.0,3028.0,1862.0,745.0,422.0,3984.0,101,161572.0
2,2014,4325.0,54380.0,2136.0,25974,849.0,43041,22103.0,3194.0,1866.0,789.0,539.0,3986.0,71,160059.0
3,2013,4697.0,54354.0,1007.0,25631,766.0,44756,25694.0,3003.0,1799.0,828.0,377.0,3539.0,67,163514.0
4,2012,4551.0,59462.0,580.0,24572,731.0,40775,26180.0,2945.0,1897.0,736.0,311.0,2992.0,53,162840.0

In [5]:
data.tail()

,Year,Coal,Natural Gas,Petroleum,Conv. Hydro,PS Hydro,Nuclear,Net Imports,Other,Waste,LFG,Wood,Wind,Solar,Total
52,1964,NaN,NaN,NaN,17943,NaN,382,NaN,NaN,NaN,NaN,NaN,NaN,0,NaN
53,1963,NaN,NaN,NaN,19071,NaN,591,NaN,NaN,NaN,NaN,NaN,NaN,0,NaN
54,1962,NaN,NaN,NaN,20598,NaN,61,NaN,NaN,NaN,NaN,NaN,NaN,0,NaN
55,1961,NaN,NaN,NaN,17869,NaN,0,NaN,NaN,NaN,NaN,NaN,NaN,0,NaN
56,1960,NaN,NaN,NaN,11746,NaN,0,NaN,NaN,NaN,NaN,NaN,NaN,0,NaN

In [6]:
afew(data)

,Year,Coal,Natural Gas,Petroleum,Conv. Hydro,PS Hydro,Nuclear,Net Imports,Other,Waste,LFG,Wood,Wind,Solar,Total
44,1972,NaN,NaN,NaN,27542,NaN,6465,NaN,NaN,NaN,NaN,NaN,NaN,0,NaN
15,2001,23432.0,38697.0,16512.0,21486,1666.0,40395,10628.0,2404.0,1837.0,284.0,283.0,21.0,0,155241.0
45,1971,NaN,NaN,NaN,25177,NaN,6521,NaN,NaN,NaN,NaN,NaN,NaN,0,NaN
43,1973,NaN,NaN,NaN,29156,NaN,7227,NaN,NaN,NaN,NaN,NaN,NaN,0,NaN
42,1974,NaN,NaN,NaN,28639,NaN,9272,NaN,NaN,NaN,NaN,NaN,NaN,0,NaN

## simplify column names

In [7]:
data.columns = (
    data.columns
    .str.strip()
    .str.lower()
    .str.replace(' ', '_')
    .str.replace('.', '')
)
data = data.rename(
    columns={
        'net_imports': 'imports',
        'petroleum': 'oil',
    }
)
data = data.sort_index(axis=1)
data.head()

,coal,conv_hydro,imports,lfg,natural_gas,nuclear,oil,other,ps_hydro,solar,total,waste,wind,wood,year
0,1493.0,26314,26117.0,748.0,56793.0,41638,643.0,2881.0,836.0,140,160798.0,1841.0,3943.0,293.0,2016
1,2046.0,25879,22273.0,745.0,56923.0,44620,1892.0,3028.0,825.0,101,161572.0,1862.0,3984.0,422.0,2015
2,4325.0,25974,22103.0,789.0,54380.0,43041,2136.0,3194.0,849.0,71,160059.0,1866.0,3986.0,539.0,2014
3,4697.0,25631,25694.0,828.0,54354.0,44756,1007.0,3003.0,766.0,67,163514.0,1799.0,3539.0,377.0,2013
4,4551.0,24572,26180.0,736.0,59462.0,40775,580.0,2945.0,731.0,53,162840.0,1897.0,2992.0,311.0,2012

## check for null values

In [8]:
data.isna().sum()

coal           20
conv_hydro      0
imports        20
lfg            41
natural_gas    20
nuclear         0
oil            20
other          30
ps_hydro       33
solar           0
total          20
waste          41
wind           20
wood           41
year            0
dtype: int64

## set index, sort, and crop

In [9]:
data = (
    data
    .set_index('year')
    .sort_index()
    .loc['1990':]
)
data.index

Index([1990, 1991, 1992, 1993, 1994, 1995, 1996, 1997, 1998, 1999, 2000, 2001,
       2002, 2003, 2004, 2005, 2006, 2007, 2008, 2009, 2010, 2011, 2012, 2013,
       2014, 2015, 2016],
      dtype='int64', name='year')

## convert datatypes

In [10]:
data = data.astype('float64')
data.info()

<class 'pandas.core.frame.DataFrame'>
Index: 27 entries, 1990 to 2016
Data columns (total 14 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   coal         27 non-null     float64
 1   conv_hydro   27 non-null     float64
 2   imports      27 non-null     float64
 3   lfg          16 non-null     float64
 4   natural_gas  27 non-null     float64
 5   nuclear      27 non-null     float64
 6   oil          27 non-null     float64
 7   other        27 non-null     float64
 8   ps_hydro     24 non-null     float64
 9   solar        27 non-null     float64
 10  total        27 non-null     float64
 11  waste        16 non-null     float64
 12  wind         27 non-null     float64
 13  wood         16 non-null     float64
dtypes: float64(14)
memory usage: 3.2 KB

## consolidate columns

In [11]:
del data['total']
data['hydro'] = data.pop('conv_hydro') + data.pop('ps_hydro')
data['gas'] = data.pop('lfg') + data.pop('natural_gas')
data.sum()

coal       498418.0
imports    464186.0
nuclear    997859.0
oil        300625.0
other       71850.0
solar         439.0
waste       30045.0
wind        29246.0
wood         5028.0
hydro      664549.0
gas        727926.0
dtype: float64

In [12]:
bigcols = data.sum().nlargest(6).index
print("Top columns:", *bigcols)

smolcols = data.columns.drop(bigcols)
print("Merging these columns:", *smolcols)

data = (
    data[bigcols]
    .assign(misc=data[smolcols]
    .sum(axis=1))
)
data.head()

Top columns: nuclear gas hydro coal imports oil
Merging these columns: other solar waste wind wood

      nuclear  gas    hydro     coal  imports      oil    misc
year
1990  23623.0  NaN      NaN  25913.0   4519.0  33885.0  2066.0
1991  28448.0  NaN      NaN  26660.0   9411.0  28221.0  2033.0
1992  24155.0  NaN      NaN  27280.0  16450.0  18319.0  2320.0
1993  26889.0  NaN  31486.0  24502.0  19509.0  15073.0  2374.0
1994  29231.0  NaN  29940.0  23291.0  18453.0  12030.0  2602.0

## save to CSV

In [13]:
print("Save as", CLEAN)
data.to_csv(CLEAN)

Save as /home/kos/data/clean/energy.csv

## check that clean data is readable

In [14]:
read_csv(CLEAN, index_col='year').tail()

      nuclear      gas    hydro    coal  imports     oil    misc
year
2012  40775.0  60198.0  25303.0  4551.0  26180.0   580.0  8198.0
2013  44756.0  55182.0  26397.0  4697.0  25694.0  1007.0  8785.0
2014  43041.0  55169.0  26823.0  4325.0  22103.0  2136.0  9656.0
2015  44620.0  57668.0  26704.0  2046.0  22273.0  1892.0  9397.0
2016  41638.0  57541.0  27150.0  1493.0  26117.0   643.0  9098.0